the_old_man_and_the_sea = {
    'name': 'Старик и море',
    'description': '«Стари́к и мо́ре» (англ. The Old Man and the Sea) — повесть американского писателя Эрнеста Хемингуэя, написанная в Бимини (Багамские острова) и вышедшая в 1952 году. Последнее известное художественное произведение Хемингуэя, опубликованное при его жизни. Рассказывает историю старика Сантьяго, кубинского рыбака, о его борьбе в открытом море с гигантским марлином, который стал самой большой добычей в его жизни.'
}

the_sun_also_rises = {
    'name': 'И восходит солнце',
    'description': '«И восходит солнце» (англ. The Sun Also Rises) — роман Эрнеста Хемингуэя, написанный в 1926 году. Основан на реальных событиях, которые происходили в жизни автора.'
}

hamlet = {
    'name': 'Гамлет',
    'description': '«Траги́ческая исто́рия о Га́млете, при́нце да́тском» (англ. The Tragedy of Hamlet, Prince of Denmark) или коротко «Га́млет, принц да́тский» или «Га́млет» — трагедия Уильяма Шекспира в пяти актах, одна из самых известных его пьес и одна из самых знаменитых пьес в мировой драматургии[1]. Написана в 1599—1601 годах. Это самая длинная пьеса Шекспира — в ней 4042 строки и 29 551 слово. Место действия пьесы — Дания, где принц Гамлет мстит своему дяде Клавдию за убийство его отца, совершённое из расчёта занять престол и жениться на матери Гамлета Гертруде.'
}