# Задание 1
# Реализуйте клиент — серверное приложение, позволяющее двум людям играть в игру крестики — нолики.
# Один из игроков инициирует игру, если второй игрок
# подтверждает, то игра начинается. Игру можно прекратить,
# тот кто прекратил игру считается проигравшим. После
# завершения игры, можно инициировать повторный матч.

# Задание 2
# Реализуйте клиент — серверное приложение, позволяющее передавать файлы. Один пользователь инициирует
# передачу файла, второй подтверждает. После подтверждения начинается отправка. Если отправка была удачной
# необходимо сообщить об этом отправителю.

# Задание 3
# Реализуйте клиент — серверное приложение, позволяющее пользователям общаться в одном чате. Каждый
# пользователь входит в чат под своим логином и паролем.
# Сообщение, отправленное в чат видно всем пользователям чата.