# Задание 1
# Создайте трёхтабличную базу данных Sales(продажи).
# В этой базе данных должны быть следующие таблицы
# Sales (информация о конкретных продажах), Salesmen
# (информация о продавцах), Customers (информация о
# покупателях). Создайте приложение для отображения
# данных из таблиц. Меню приложения должно содержать
# такой минимальный набор отчётов:
# ■ Отображение всех сделок;
# ■ Отображение сделок конкретного продавца;
# ■ Отображение максимальной по сумме сделки;
# ■ Отображение минимальной по сумме сделки;
# ■ Отображение максимальной по сумме сделки для
# конкретного продавца;
# ■ Отображение минимальной по сумме сделки для
# конкретного продавца;
# ■ Отображение максимальной по сумме сделки для
# конкретного покупателя;
# ■ Отображение минимальной по сумме сделки для
# конкретного покупателя;
# ■ Отображение продавца, у которого максимальная
# сумма продаж по всем сделкам;
# ■ Отображение продавца, у которого минимальная
# сумма продаж по всем сделкам;
# ■ Отображение покупателя, у которого максимальная
# сумма покупок по всем сделкам;
# ■ Отображение средней суммы покупки для конкретного покупателя;
# ■ Отображение средней суммы покупки для конкретного продавца.

# Задание 2
# Добавьте механизмы для обновления, удаления и
# вставки данных в базу данных используя интерфейс меню.
# Пользователь не может ввести запросы INSERT, UPDATE,
# DELETE напрямую. Запретите возможность обновления
# и удаления всех данных для каждой из таблиц (UPDATE
# и DELETE без условий).

# Задание 3
# Добавьте к первому заданию возможность сохранения
# результатов фильтров в файл. Путь и название к файлу
# указываются в настройках приложения.